In [1]:
print("HW")

HW

# Question 1

In [2]:
data = [4, 8, 15, 16, 23, 42]
import pandas as pd
df = pd.DataFrame(data)

In [3]:
df

    0
0   4
1   8
2  15
3  16
4  23
5  42

In [5]:
# we have not given string in square brackets because by default header is none and columns are indexed
dataSeries = df[0]

In [6]:
dataSeries

0     4
1     8
2    15
3    16
4    23
5    42
Name: 0, dtype: int64

# Question 2

In [7]:
List = [1, 2, "Vignesh", "LNMIIT", "IIT Ropar", "Java", "PW PPT", "uday", "Reddy", 7.63]
List

[1,
 2,
 'Vignesh',
 'LNMIIT',
 'IIT Ropar',
 'Java',
 'PW PPT',
 'uday',
 'Reddy',
 7.63]

In [8]:
print(type(List))
print(len(List))

<class 'list'>
10

In [9]:
data_series = pd.Series(List)
print(data_series)

0            1
1            2
2      Vignesh
3       LNMIIT
4    IIT Ropar
5         Java
6       PW PPT
7         uday
8        Reddy
9         7.63
dtype: object

# Question 3

In [14]:
import pandas as pd
df = pd.DataFrame({
                      "Name" : ["Alice", "Bob", "Claire"],
                      "Age" : [25, 30, 27],
                      "Gender" : ["Female", "Male", "Female"]
                 })

In [15]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

# Question 4

In [ ]:
"""
Data frame -> It is a tabular form of data which consists of rows and columns.
Data series -> From a data frame, you select a single column and all rows corresponding to columns. 
               This is called a Data series. 
               Even if the rows are sliced then also it is a data series 
"""

In [16]:
# we are going to tanke example of a data frame which was made in Q3
# this is a data frame
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [17]:
# select one column in a data frame, it will be data series
df['Name']

0     Alice
1       Bob
2    Claire
Name: Name, dtype: object

In [19]:
# if you select multiple columns
# it will become a data frame
df[['Name', 'Age']]

     Name  Age
0   Alice   25
1     Bob   30
2  Claire   27

In [20]:
# we have sliced the rows in series
# finally it has become a series
df["Name"][0:2]

0    Alice
1      Bob
Name: Name, dtype: object

# Question 5

In [ ]:
"""
Some of the common functions used to manipulate data in data frame are :
Lets assume df is our data frame.
df.columns
df.dtypes
df.head()
df.tail()
df['Column Name']
df[['Column Name 1', 'Column Name 2', ...]]
df.describe()
"""

# Question 7

In [21]:
S1 = pd.Series([1, 2, 3, 4, 5, 6])
S2 = pd.Series(["Vignesh", "Suyash", "Anish", "Guneeth", "Hritik", " Saif"])
S3 = pd.Series([7.63, 10, 7.3, 5.63, 4, 5])

In [29]:
df = pd.DataFrame({
                      0 : S1,
                      1 : S2,
                      2 : S3
                 })

In [30]:
df

   0        1      2
0  1  Vignesh   7.63
1  2   Suyash  10.00
2  3    Anish   7.30
3  4  Guneeth   5.63
4  5   Hritik   4.00
5  6     Saif   5.00

In [ ]:
df1 =